import React from 'react';
import ArticleImage from '../../Article/ArticleImage';
import MainTitle from '../../Article/MainTitle';
import Paragraph from '../../Article/Paragraph';
import SubTitle from '../../Article/SubTitle';

const ArticleContent = () => {
    return (
        <div className='mt-2'>
            <MainTitle>کلاس های کنکوری و رفع اشکال</MainTitle>
<Paragraph>زبان انگلیسی یکی از شیرین‌ترین، کاربردی‌ترین و پرطرفدارترین زبان‌های دنیا محسوب می‌شود. افراد زیادی در سرتاسر جهان به این زبان صحبت می‌کنند و بسیاری از پژوهش‌ها و تعاملات علمی دنیا به زبان انگلیسی صورت می‌گیرد. علاوه برآن، فرصت‌های شغلی این رشته تنوع بسیار بالایی دارد و به همین دلیل است که سالانه تعداد زیادی از دانش آموزان، در کنکور زبان‌های خارجه به عنوان رشته تخصصی و یا شناور، به رقابت می‌پردازند.</Paragraph>

<SubTitle>کنکور زبان چیست؟</SubTitle>
<Paragraph>متقاضیان کنکور زبان به دو دسته تقسیم می‌شوند که گروه اول، تنها در کنکور زبان شرکت کرده و تمام تمرکز خود را برای قبولی در رشته‌های مرتبط مانند مترجمی، ادبیات و آموزش می‌گذارند.</Paragraph>
<Paragraph>از طرفی دیگر برخی داوطلبان، کنکور زبان خارجه را به عنوان یک جایگزین و گزینه‌ی دوم برمی‌گزینند تا در صورت عدم قبولی در رشته‌های علوم ریاضی، تجربی و انسانی، شانس خود را در این زمینه را نیز امتحان کنند. اما نکته مهم این است که در هر دو صورت اگر داوطلب مجاز به تحصیل در گرایش‌های متنوع زبان شود، آینده‌ی بسیار خوبی خواهد داشت و افراد قادر به ادامه تحصیل تا مقطع دکتری هستند.</Paragraph>

<SubTitle>تعداد سوالات و سرفصل های مهم:</SubTitle>
<Paragraph>سوالات کنکور زبان یک دفترچه تخصصی 70 سواله است که شرکت کنندگان ۱۰۵ دقیقه برای پاسخ به آن فرصت دارند.</Paragraph>
<Paragraph>این سوالات در 6 بخش طبقه بندی میشوند:</Paragraph>
<Paragraph>1. دستور زبان و گرامر (10 سوال)</Paragraph>
<Paragraph>2. واژگان (15 سوال)</Paragraph>
<Paragraph>3. ترتیب واژگان (5 سوال)</Paragraph>
<Paragraph>4. درک مطلب (20 سوال)</Paragraph>
<Paragraph>5. کاربرد زبان (10 سوال)</Paragraph>
<Paragraph>6. کلوز تست (10 سوال)</Paragraph>

<SubTitle>شرایط کلاس ها:</SubTitle>
<Paragraph>با توجه به نیاز مبرم دانش آموزان نسبت به یادگیری زبان انگلیسی و پیچیدگی کتابهای درسی و لزوم مرور مطالب آموخته شده، علی الخصوص در بازه زمانی نزدیک به امتحانات پایان ترم، شما می‌توانید در کلاس های زیر شرکت کنید:</Paragraph>
<Paragraph>1. کلاس مرور و رفع اشکال</Paragraph>
<Paragraph>2. کلاس تقویتی پایه دهم تا دوازدهم</Paragraph>
<Paragraph>علاوه برموارد بالا، شما میتوانید در دوره های تخصصی کنکور نیز شرکت کنید.</Paragraph>
<Paragraph>در این راستا، با تکیه بر تجربه و تخصص، دوره ای تهیه شده که هدف اصلی آن، آمادگی دانش‌آموزان در (سه مرحله اصلی) برای شرکت در آزمون کنکور میباشد:</Paragraph>
<Paragraph>۱. تدریس سرفصل‌های مهم کنکور.</Paragraph>
<Paragraph>۲. رفع اشکال و تحلیل سوالات کنکور‌های پیشین.</Paragraph>
<Paragraph>۳. آموزش تکنیک‌های تست زنی‌.</Paragraph>

<p style={{fontFamily:"KalamehWeb-Bold" , fontSize:"16px" , lineHeight:"28px"}}>برای کسب اطلاعات بیشتر و ثبت نام در کلاس مورد نظر، از طریق راه های ارتباطی موجود در سایت با ما در تماس باشید.</p>

        </div>
    );
};

export default ArticleContent;